iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32L1xx/emptyTargetInit/stm32l1_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1RST:1;
      uint64_t DMA2RST:1;
      uint64_t reservedSpace0:6;
      uint64_t FLASHRST:1;
      uint64_t reservedSpace1:3;
      uint64_t CRCRST:1;
      uint64_t reservedSpace2:3;
      uint64_t TSCRST:1;
      uint64_t DMA2DRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB1RSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIOARST:1;
      uint64_t GPIOBRST:1;
      uint64_t GPIOCRST:1;
      uint64_t GPIODRST:1;
      uint64_t GPIOERST:1;
      uint64_t GPIOFRST:1;
      uint64_t GPIOGRST:1;
      uint64_t GPIOHRST:1;
      uint64_t GPIOIRST:1;
      uint64_t reservedSpace0:3;
      uint64_t OTGFSRST:1;
      uint64_t ADCRST:1;
      uint64_t DCMIRST:1;
      uint64_t reservedSpace1:1;
      uint64_t AESRST:1;
      uint64_t HASH1RST:1;
      uint64_t RNGRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB2RSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMCRST:1;
      uint64_t reservedSpace0:7;
      uint64_t QSPIRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB3RSTR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2RST:1;
      uint64_t TIM3RST:1;
      uint64_t TIM4RST:1;
      uint64_t TIM5RST:1;
      uint64_t TIM6RST:1;
      uint64_t TIM7RST:1;
      uint64_t reservedSpace0:3;
      uint64_t LCDRST:1;
      uint64_t reservedSpace1:4;
      uint64_t SPI2RST:1;
      uint64_t SPI3RST:1;
      uint64_t reservedSpace2:1;
      uint64_t USART2RST:1;
      uint64_t USART3RST:1;
      uint64_t UART4RST:1;
      uint64_t UART5RST:1;
      uint64_t I2C1RST:1;
      uint64_t I2C2RST:1;
      uint64_t I2C3RST:1;
      uint64_t CRSRST:1;
      uint64_t CAN1RST:1;
      uint64_t CAN2RST:1;
      uint64_t reservedSpace3:1;
      uint64_t PWRRST:1;
      uint64_t DAC1RST:1;
      uint64_t OPAMPRST:1;
      uint64_t LPTIM1RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1RSTR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPUART1RST:1;
      uint64_t I2C4RST:1;
      uint64_t SWPMI1RST:1;
      uint64_t reservedSpace0:2;
      uint64_t LPTIM2RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1RSTR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCFGRST:1;
      uint64_t reservedSpace0:9;
      uint64_t SDMMCRST:1;
      uint64_t TIM1RST:1;
      uint64_t SPI1RST:1;
      uint64_t TIM8RST:1;
      uint64_t USART1RST:1;
      uint64_t reservedSpace1:1;
      uint64_t TIM15RST:1;
      uint64_t TIM16RST:1;
      uint64_t TIM17RST:1;
      uint64_t reservedSpace2:2;
      uint64_t SAI1RST:1;
      uint64_t SAI2RST:1;
      uint64_t reservedSpace3:1;
      uint64_t DFSDMRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2RSTR;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1EN:1;
      uint64_t DMA2EN:1;
      uint64_t reservedSpace0:6;
      uint64_t FLASHEN:1;
      uint64_t reservedSpace1:3;
      uint64_t CRCEN:1;
      uint64_t reservedSpace2:3;
      uint64_t TSCEN:1;
      uint64_t DMA2DEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB1ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIOAEN:1;
      uint64_t GPIOBEN:1;
      uint64_t GPIOCEN:1;
      uint64_t GPIODEN:1;
      uint64_t GPIOEEN:1;
      uint64_t GPIOFEN:1;
      uint64_t GPIOGEN:1;
      uint64_t GPIOHEN:1;
      uint64_t GPIOIEN:1;
      uint64_t reservedSpace0:3;
      uint64_t OTGFSEN:1;
      uint64_t ADCEN:1;
      uint64_t DCMIEN:1;
      uint64_t reservedSpace1:1;
      uint64_t AESEN:1;
      uint64_t HASH1EN:1;
      uint64_t RNGEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB2ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMCEN:1;
      uint64_t reservedSpace0:7;
      uint64_t QSPIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB3ENR;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2EN:1;
      uint64_t TIM3EN:1;
      uint64_t TIM4EN:1;
      uint64_t TIM5EN:1;
      uint64_t TIM6EN:1;
      uint64_t TIM7EN:1;
      uint64_t reservedSpace0:3;
      uint64_t LCDEN:1;
      uint64_t RTCAPBEN:1;
      uint64_t WWDGEN:1;
      uint64_t reservedSpace1:2;
      uint64_t SPI2EN:1;
      uint64_t SP3EN:1;
      uint64_t reservedSpace2:1;
      uint64_t USART2EN:1;
      uint64_t USART3EN:1;
      uint64_t UART4EN:1;
      uint64_t UART5EN:1;
      uint64_t I2C1EN:1;
      uint64_t I2C2EN:1;
      uint64_t I2C3EN:1;
      uint64_t CRSEN:1;
      uint64_t CAN1EN:1;
      uint64_t CAN2EN:1;
      uint64_t reservedSpace3:1;
      uint64_t PWREN:1;
      uint64_t DAC1EN:1;
      uint64_t OPAMPEN:1;
      uint64_t LPTIM1EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1ENR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPUART1EN:1;
      uint64_t I2C4EN:1;
      uint64_t SWPMI1EN:1;
      uint64_t reservedSpace0:2;
      uint64_t LPTIM2EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1ENR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCFGEN:1;
      uint64_t reservedSpace0:6;
      uint64_t FIREWALLEN:1;
      uint64_t reservedSpace1:2;
      uint64_t SDMMCEN:1;
      uint64_t TIM1EN:1;
      uint64_t SPI1EN:1;
      uint64_t TIM8EN:1;
      uint64_t USART1EN:1;
      uint64_t reservedSpace2:1;
      uint64_t TIM15EN:1;
      uint64_t TIM16EN:1;
      uint64_t TIM17EN:1;
      uint64_t reservedSpace3:2;
      uint64_t SAI1EN:1;
      uint64_t SAI2EN:1;
      uint64_t reservedSpace4:1;
      uint64_t DFSDMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2ENR;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1SMEN:1;
      uint64_t DMA2SMEN:1;
      uint64_t reservedSpace0:6;
      uint64_t FLASHSMEN:1;
      uint64_t SRAM1SMEN:1;
      uint64_t reservedSpace1:2;
      uint64_t CRCSMEN:1;
      uint64_t reservedSpace2:3;
      uint64_t TSCSMEN:1;
      uint64_t DMA2DSMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB1SMENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIOASMEN:1;
      uint64_t GPIOBSMEN:1;
      uint64_t GPIOCSMEN:1;
      uint64_t GPIODSMEN:1;
      uint64_t GPIOESMEN:1;
      uint64_t GPIOFSMEN:1;
      uint64_t GPIOGSMEN:1;
      uint64_t GPIOHSMEN:1;
      uint64_t GPIOISMEN:1;
      uint64_t SRAM2SMEN:1;
      uint64_t reservedSpace0:2;
      uint64_t OTGFSSMEN:1;
      uint64_t ADCFSSMEN:1;
      uint64_t DCMISMEN:1;
      uint64_t reservedSpace1:1;
      uint64_t AESSMEN:1;
      uint64_t HASH1SMEN:1;
      uint64_t RNGSMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB2SMENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMCSMEN:1;
      uint64_t reservedSpace0:7;
      uint64_t QSPISMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB3SMENR;

