iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32L1xx/emptyTargetInit/stm32l1_sfr.h
};

#define PWR_0 (*(volatile struct PWR_0_tag *) 0x40007000)

struct SYSCFG_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MEM_MODE:3;
      uint64_t QFS:1;
      uint64_t reservedSpace0:4;
      uint64_t FB_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MEMRMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FWDIS:1;
      uint64_t reservedSpace0:7;
      uint64_t BOOSTEN:1;
      uint64_t reservedSpace1:7;
      uint64_t I2C_PB6_FMP:1;
      uint64_t I2C_PB7_FMP:1;
      uint64_t I2C_PB8_FMP:1;
      uint64_t I2C_PB9_FMP:1;
      uint64_t I2C1_FMP:1;
      uint64_t I2C2_FMP:1;
      uint64_t I2C3_FMP:1;
      uint64_t reservedSpace2:3;
      uint64_t FPU_IE:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI0:3;
      uint64_t reservedSpace0:1;
      uint64_t EXTI1:3;
      uint64_t reservedSpace1:1;
      uint64_t EXTI2:3;
      uint64_t reservedSpace2:1;
      uint64_t EXTI3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTICR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI4:3;
      uint64_t reservedSpace0:1;
      uint64_t EXTI5:3;
      uint64_t reservedSpace1:1;
      uint64_t EXTI6:3;
      uint64_t reservedSpace2:1;
      uint64_t EXTI7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTICR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI8:3;
      uint64_t reservedSpace0:1;
      uint64_t EXTI9:3;
      uint64_t reservedSpace1:1;
      uint64_t EXTI10:3;
      uint64_t reservedSpace2:1;
      uint64_t EXTI11:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTICR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI12:3;
      uint64_t reservedSpace0:1;
      uint64_t EXTI13:3;
      uint64_t reservedSpace1:1;
      uint64_t EXTI14:3;
      uint64_t reservedSpace2:1;
      uint64_t EXTI15:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTICR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRAM2ER:1;
      uint64_t SRAM2BSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLL:1;
      uint64_t SPL:1;
      uint64_t PVDL:1;
      uint64_t ECCL:1;
      uint64_t reservedSpace0:4;
      uint64_t SPF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P0WP:1;
      uint64_t P1WP:1;
      uint64_t P2WP:1;
      uint64_t P3WP:1;
      uint64_t P4WP:1;
      uint64_t P5WP:1;
      uint64_t P6WP:1;
      uint64_t P7WP:1;
      uint64_t P8WP:1;
      uint64_t P9WP:1;
      uint64_t P10WP:1;
      uint64_t P11WP:1;
      uint64_t P12WP:1;
      uint64_t P13WP:1;
      uint64_t P14WP:1;
      uint64_t P15WP:1;
      uint64_t P16WP:1;
      uint64_t P17WP:1;
      uint64_t P18WP:1;
      uint64_t P19WP:1;
      uint64_t P20WP:1;
      uint64_t P21WP:1;
      uint64_t P22WP:1;
      uint64_t P23WP:1;
      uint64_t P24WP:1;
      uint64_t P25WP:1;
      uint64_t P26WP:1;
      uint64_t P27WP:1;
      uint64_t P28WP:1;
      uint64_t P29WP:1;
      uint64_t P30WP:1;
      uint64_t P31WP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SKR;

};

#define SYSCFG_0 (*(volatile struct SYSCFG_0_tag *) 0x40010000)

struct DFSDM1_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SITP:2;
      uint64_t SPICKSEL:2;
      uint64_t reservedSpace0:1;
      uint64_t SCDEN:1;
      uint64_t CKABEN:1;
      uint64_t CHEN:1;
      uint64_t CHINSEL:1;
      uint64_t reservedSpace1:3;
      uint64_t DATMPX:2;
      uint64_t DATPACK:2;
      uint64_t CKOUTDIV:8;
      uint64_t reservedSpace2:6;
      uint64_t CKOUTSRC:1;
      uint64_t DFSDMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCFG0R1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t DTRBS:5;
      uint64_t OFFSET:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCFG0R2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCDT:8;
      uint64_t reservedSpace0:4;
      uint64_t BKSCD:4;
      uint64_t AWFOSR:5;
      uint64_t reservedSpace1:1;
      uint64_t AWFORD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AWSCD0R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHWDAT0R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDAT0:16;
      uint64_t INDAT1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHDATIN0R;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SITP:2;
      uint64_t SPICKSEL:2;
      uint64_t reservedSpace0:1;
      uint64_t SCDEN:1;
      uint64_t CKABEN:1;
      uint64_t CHEN:1;
      uint64_t CHINSEL:1;
      uint64_t reservedSpace1:3;
      uint64_t DATMPX:2;
      uint64_t DATPACK:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCFG1R1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t DTRBS:5;
      uint64_t OFFSET:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCFG1R2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCDT:8;
      uint64_t reservedSpace0:4;
      uint64_t BKSCD:4;
      uint64_t AWFOSR:5;
      uint64_t reservedSpace1:1;
      uint64_t AWFORD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AWSCD1R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHWDAT1R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDAT0:16;
      uint64_t INDAT1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHDATIN1R;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SITP:2;
      uint64_t SPICKSEL:2;
      uint64_t reservedSpace0:1;
      uint64_t SCDEN:1;
      uint64_t CKABEN:1;
      uint64_t CHEN:1;
      uint64_t CHINSEL:1;
      uint64_t reservedSpace1:3;
      uint64_t DATMPX:2;
      uint64_t DATPACK:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCFG2R1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t DTRBS:5;
      uint64_t OFFSET:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCFG2R2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCDT:8;
      uint64_t reservedSpace0:4;
      uint64_t BKSCD:4;
      uint64_t AWFOSR:5;
      uint64_t reservedSpace1:1;
      uint64_t AWFORD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AWSCD2R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHWDAT2R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDAT0:16;
      uint64_t INDAT1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHDATIN2R;

